{"BALL_LIGHTNING":"Fires a slow-moving projectile that periodically damages enemies in an area around it with bolts of lightning","BLADE_BLOSSOM":"Creates knives on the ground which fly upwards after a short delay","BLADE_FLURRY":"Repeatedly hit enemies in a circle in front of encounter while channelling, dealing damage to and around the enemy. The damage is continually boosted while channelling. Encounter unleashes an additional hit for each stage reached once the channelling ends","BOOKS_DISCHARGE":"Sets a book marker at a location. After a short duration, lightning strikes the marker, dealing damage around it. When this happens, it will also set off the lightning at any other markers encounter has cast","CHARGE":"Charges at player's location. This knocks the encounter back and stuns it. Enemies in the way are pushed to the side. Damage and stun are proportional to distance travelled","CAUSTIC_ARROW":"Fires an arrow which deals chaos damage in an area on impact, and spreads caustic ground. Enemies standing on the caustic ground take chaos damage over time","CHILLED_GROUND":"Slows player's cast speed, attack speed and movement speed","CLEAVE":"Swings weapon (or both weapons if dual wielding) in an arc, damaging enemies in an area in front of them","CONDUCTIVITY":"Curses all targets in an area, making them less resistant to lightning damage and gives damage hit more chance to shock","CYCLONE":"Damages enemies around encounter, then performs a spinning series of attacks as it travels to a target location","DESECRATE":"Desecrates the ground, summoning corpses and dealing chaos damage to all enemies in the area","DETONATE_DEAD":"Explosion deals base Fire Damage equal to 1% of the corpse's Maximum Life","ETHEREAL_KNIVES":"Fires an arc of knives in front of the encounter which deals physical damage","EXPLODING_POD":"Spawns multiple pods. When ran through pods explode after a short delay","FIREBALL":"Unleashes a ball of fire towards a target which explodes, damaging nearby foes","FIRE_BOMBS":"Spawns multiple Fire Bombs around the arena that explode after a delay","FIRESTORM":"Rains numerous fiery bolts in an area","FLAMMABILITY":"Curses all targets in an area, making them less resistant to fire damage and gives damage hit more chance to ignite","FLAME_SURGE":"Strikes enemies in front of encounter with a surge of flame. Deals more damage to Burning enemies","FLICKER_STRIKE":"Teleports the character to a nearby monster and attacks with a melee weapon","FROSTBALL":"Fires a slow-moving projectile that pierces through enemies, dealing cold damage","GHOST_ORB":"Spawns orbs around the area that move in a stright line in random direction","ICE_NOVA":"A chilling circle of ice expands from the caster. If the caster targets near their Frostbolt projectiles, it will expand from a number of those projectiles instead","INVULNERABILITY_AT_30":"Becomes untargettable when encounter reaches 30% hp","INVULNERABILITY_END_ALL_BOSS_PRESENT":"Becomes targetable once all 3 bosses are present","LACERATE":"Slashes twice, releasing waves of force that damage enemies they hit. Enemies in the middle of the slashes can be hit by both slashes","LACERATE_SAND":"The yellow slashes have wider angle","LACERATE_BLOOD":"The red slashes will have a chance to inflict bleeding","LEAP_SLAM":"Jumps into the air, damaging and knocking back enemies with their weapon where they land. Enemies they would land on are pushed out of the way","LEAP_SLAM_FIRE_GROUND_EFFECT":"Upon landing creates burning ground","LIGHTNING_BOLT":"Fires few Lightning Bolts at you","LIGHTNING_BOMBS":"Spawns multiple Lightning Bombs around the arena that explode after a delay","MORTAR":"Fires projectile that do damage on impact and when they explode","REVIVE_MINIONS":"Revives minions","SHOCK_NOVA":"Deals lightning damage in an area around the caster, conjuring an initial ring followed by a larger circular area.","SHOCK_NOVA_SHOCK":"Has a high chance to shock","SMOKE_BOMB":"Throws a trap that creates cloud of smoke that blinds everyone standing in it","SOUL_EATER":"For each new spawn death near encounter, encounter gains more damage, cast speed and attack speed","SPAWN_TOTEM":"Spawns totem(s)","SPLIT_ARROW":"Fires multiple arrows at different targets","STORM_BURST":"Unleashes a stream of projectiles while encounter channels this spell, which pierce through enemies, dealing lightning damage. When encounter stops channelling, the projectiles explode, dealing significant damage in an area around them. Additional projectiles are added in sequence","STORM_CALL":"Sets a marker at a location. After a short duration, lightning strikes the marker, dealing damage around it. When this happens, it will also set off the lightning at any other markers encounter has cast","TAKEOFF":"Encounter goes airborne. After short period of time encounter slams to the ground","THROWN_SHIELD":"Throws a spectral copy of encounters shield as a projectile which cannot pierce, and deals off-hand damage augmented by the defences of the shield. When it collides with something it will shatter, launching a number of smaller shards as projectiles in all directions","TELEPORT":"Teleports encounter to random location in an area","WEB_MORTAR":"Mortar projectile that leaves ground effect","WEB_MORTAR_GROUND_EFFECT":"While standing in web your speed is reduced","VAAL_BURNING_ARROW":"Fires an arrow that explodes, dealing fire damage to its target and other nearby enemies, with an increased chance of igniting them","VAAL_RAIN_OF_ARROWS":"Fires a large number of arrows into the air, to land at the target after a short delay. Enemies hit by the arrows are pinned in place, unable to move for a time","VAAL_SUMMON_SKELETONS":"Summons an army of skeletal warriors, archers and mages, led by a powerful general"}